# Midterm Project: Sakila Data Mart 
### Rachel Ney-Grimm
#### Project Sumary:
The data mart created here is a star schema. The fact table is a based on the rental/payment business process, and there are 3 dimension tables: dim_customers, dim_film, and dim_date, which connect to the fact table with foreign keys. I exported the 'film' table's data from MySQL to MongoDB as a JSON file and retrieved it from this source when making my dim_film table. I also utilized the file system, saving the 'language' data from MySQL as a CSV and then retrieving it from there, to use it as an addition to my dim_film table. The rest of my data was retrieved from SQL directly. I did the majority of my data manipulation and table creation in python as part of this Jupyter Notebook. The exception to this was a SQL script that I ran to create and populate the dim_date table and then integrate it into the 'fact_rental' table. This script also did the work needed to add a 'film_key' to the 'fact_rental' table. Throughout the creation of all these tables, I made transformations such as renaming columns, dropping unneeded columns, and reordering the columns. Once I had created my data mart, I made queries to find the top spending customers and to find which dvds brought in the most revenue during a given month to validate that my data mart was successfully created and functional.

To begin, I first imported the necessary libraries and set up the connections to the MySQL Server and MongoDB, where I retrieve data from to construct the data mart. I added the functions for getting and setting database data, and finally, I created sakila_2, the destination of my ETL pipeline.

In [46]:
#libraries
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine
import json
import datetime
import pymongo

#connection setup
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

#setup for mongodb connection
mysql_uid = "root" #root when not in cloud
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

#database source and destination
src_dbname = "sakila"
dst_dbname = "sakila_2"

#database function definitions
def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe

def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    return dframe

def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
    
#creating new database    
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

#finish mongodb connection setup 
conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://m001-student:m001-mongodb-basics@sandbox.zibbf.mongodb.net

### Customer Dimension Table
I first created the 'dim_customer' dimension table from data originating at the MySQL sakila database. I transformed this data by renaming what will be table's key, and dropping the columns that aren't needed in the new schema. I added the address information to the customer dimension table directly rather than keeping it as a foreign key relationship as it was in the normalized database. To do this I joined country, city, address, and finally customer using the pandas merge function. This gave me what I wanted for the customer dimension table so I wrote the customers dataframe to the destination database and validated that this operation was successful.

In [47]:
#extracting the data from the source with a sql select statement into a dataframe
sql_customers = "SELECT * FROM sakila.customer;"
df_customers = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_customers)
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [48]:
#rename id column to fit data warehouse standard, drop undesired columns
df_customers.rename(columns={"customer_id":"customer_key"}, inplace=True)
df_customers.drop(['store_id'], axis=1, inplace=True)
df_customers.head(2)

,customer_key,first_name,last_name,email,address_id,active,create_date,last_update
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [49]:
#bring in address, city, and country tables in as dataframes
#these will be used to add address information to the customer dimension table

sql_address = "SELECT * FROM sakila.address;"
df_address = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_address)

sql_city = "SELECT city_id , city , country_id FROM sakila.city;"
df_city = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_city)

sql_country = "SELECT country_id, country FROM sakila.country;"
df_country = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_country)


#drop columns that are empty ('address2') or which contain binary large objects that won't be conducive to analysis (location')
df_address.drop(['location', 'address2', 'last_update'], axis=1, inplace=True)

In [50]:
#making all the needed merges to get the desired address information into the customer dimension table

#merge country into city
df_city= pd.merge(df_city, df_country, on='country_id', how='left')#or inner
#df_city.head(2)

#merge city into address
df_address= pd.merge(df_address, df_city, on='city_id', how='left')
#df_address.head(2)

#merge address into the customer table - end goal
df_customers= pd.merge(df_customers, df_address, on='address_id', how='left')

#the address information is now attached in the dimension table
#so we can drop the ids of the merged tables
df_customers.drop(['address_id','city_id', 'country_id'], axis=1, inplace=True)
df_customers.head(2)

,customer_key,first_name,last_name,email,active,create_date,last_update,address,district,postal_code,phone,city,country
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1913 Hanoi Way,Nagasaki,35200,28303384290,Sasebo,Japan
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1121 Loja Avenue,California,17886,838635286649,San Bernardino,United States

In [51]:
#load into data warehouse
#dataframe -> tables
db_operation = "insert"
tables = [('dim_customers', df_customers, 'customer_key')]
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)
    
#validate that it was added to the database successfully by retrieving it with a select statement
sql_dim_customers = "SELECT * FROM sakila_2.dim_customers;"
df_dim_customers = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_dim_customers)
df_dim_customers.head(2)

,customer_key,first_name,last_name,email,active,create_date,last_update,address,district,postal_code,phone,city,country
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1913 Hanoi Way,Nagasaki,35200,28303384290,Sasebo,Japan
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1121 Loja Avenue,California,17886,838635286649,San Bernardino,United States

### Film Dimension Table
Data on the film's language is retrieved from the <b>file system</b>. The rest of the film data is retrieved from <b>MongoDB</b>. Simple transformations are made to the imported data (dropping unnecessary or duplicate columns, renaming the key). The film dataframe is then merged with the language dataframe on the shared language_id column. This is to add the language of a film as a column in the film dimension table, allowing for easier access for future analyses. After transformations, the final film dataframe is used to create a new film dimension table in the data mart. Last I validated that the dimension table was successfully created with the appropriate data by querying it.

In [52]:
#get the sakila language data from the file system
#will later merge to become part of the film dimension table
data_file = os.path.join(os.getcwd(), 'sakila_language_data.csv')
df_language = pd.read_csv(data_file, header=0, index_col=0)
df_language.drop(['last_update'], axis=1, inplace=True)
df_language.head()

                 name
language_id
1             English
2             Italian
3            Japanese
4            Mandarin
5              French

In [53]:
#get sakila film data from mongodb
query = {}
collection = "film"
df_film = get_mongo_dataframe(conn_str["local"], src_dbname, collection, query)#select everthing from film use to make a df
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [54]:
#perform initial transormations on film data
#drop data we are not interested in for analyzing the business processes
df_film.drop(['original_language_id'], axis=1, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True) #dont want id to be called just id
df_film.head(2) #id column now film_key

,film_key,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [55]:
#merge language and film on language id (left) using pandas
df_film = pd.merge(df_film, df_language, on='language_id', how='left')#or inner
df_film.rename(columns={"name":"film_language"}, inplace=True) #rename the column containing the language of the film to be more intuitive
df_film.drop(['language_id'], axis=1, inplace=True)
df_film.head(2)

,film_key,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update,film_language
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42,English

In [56]:
#load the film dataframe into newly created film table in datawarehouse, 
dataframe = df_film
table_name = 'dim_film'
primary_key = 'film_key'
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation) #from

#validate that it was created and loaded successfully
sql_film = "SELECT * FROM sakila_2.dim_film;"
df_dim_film = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_film)
df_dim_film.head(2)

,film_key,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update,film_language
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42,English

## Fact Table
The fact table I created is based primarily off of the rental process that is modeled in the sakila database. I incorporated data pertaining to the payments for the rentals as well, in order to provide more quantitative information on the transactions. I did this by merging the payment table with the original rental table on rental_id. This added columns containing data on the dollar amount of a transaction and the date the payment occurred. I then performed transformations of the columns, dropping the columns that contained ids of tables that I was not including in my data mart. FOr the

In [57]:
#getting the rental data from sql as a dataframe
sql_rental = "SELECT * FROM sakila.rental;"
df_rental = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [58]:
#getting the relevant/desired payment data
sql_payment = "SELECT amount, rental_id, payment_date FROM sakila.payment;"
df_payment = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)
df_payment.head(2)

   amount  rental_id        payment_date
0    2.99         76 2005-05-25 11:30:37
1    0.99        573 2005-05-28 10:35:23

In [59]:
#merge the payment data into what will become the fact_rental table
df_rental = pd.merge(df_rental, df_payment, on='rental_id', how='left')
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,amount,payment_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2.99,2005-05-24 22:53:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2.99,2005-05-24 22:54:33
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,3.99,2005-05-24 23:03:39
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,4.99,2005-05-24 23:04:41
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,6.99,2005-05-24 23:05:21

In [60]:
#perform transformations on the fact rental table: 
#renaming id columns to be keys
column_name_map = {"rental_id" : "rental_key",
                   "customer_id" : "customer_key"
                  }
df_rental.rename(columns=column_name_map, inplace=True)

#dropping an unused column, reordering the remaining columns and adding the primary key
df_rental.drop(['staff_id'], axis=1, inplace=True)
df_rental=df_rental[['rental_key','customer_key', 'inventory_id','amount','rental_date','return_date','payment_date','last_update']]
df_rental.insert(0, "fact_rental_key", range(1, df_rental.shape[0]+1)) #create primary key in that table, create auto increment column
df_rental.head(2)

,fact_rental_key,rental_key,customer_key,inventory_id,amount,rental_date,return_date,payment_date,last_update
0,1,1,130,367,2.99,2005-05-24 22:53:30,2005-05-26 22:04:30,2005-05-24 22:53:30,2006-02-15 21:30:53
1,2,2,459,1525,2.99,2005-05-24 22:54:33,2005-05-28 19:40:33,2005-05-24 22:54:33,2006-02-15 21:30:53

In [61]:
#write the dataframe to the database as a table 
dataframe = df_rental
table_name = 'fact_rental'
primary_key = 'fact_rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [62]:
#validate that it was written by retrieving it from sakila_2
sql_rental = "SELECT * FROM sakila_2.fact_rental;"
df_fact_rental = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_rental)
df_fact_rental.head(2)

,fact_rental_key,rental_key,customer_key,inventory_id,amount,rental_date,return_date,payment_date,last_update
0,1,1,130,367,2.99,2005-05-24 22:53:30,2005-05-26 22:04:30,2005-05-24 22:53:30,2006-02-15 21:30:53
1,2,2,459,1525,2.99,2005-05-24 22:54:33,2005-05-28 19:40:33,2005-05-24 22:54:33,2006-02-15 21:30:53

### Date Dimension Table
A date dimension table for the sakila data warehouse was created from the script provied in Lab 2C, run in MySQL workbench. After the date dimension table was created it needed to be connected to the fact table. Using a script based on the one from Lab2D, key columns were added to the fact table for each date that the fact table contained: rental_date, return_date, payment_date, and last_update. The tables were joined on the key columns, populating them. Finally, the columns original columns were dropped from the table. The result can be viewed below. The script that did this work is also attached in my github.

In [65]:
#show properly constructed date dimension table
sql_dim_date = "SELECT * FROM sakila_2.dim_date;"
df_dim_date = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.head()

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,20050501,2005-05-01,2005/05/01,05/01/2005,01/05/2005,1,Sunday,1,121,Weekend,...,N,2,2005,2005-05,2005Q2,11,4,2005,2005-11,2005Q4
1,20050502,2005-05-02,2005/05/02,05/02/2005,02/05/2005,2,Monday,2,122,Weekday,...,N,2,2005,2005-05,2005Q2,11,4,2005,2005-11,2005Q4
2,20050503,2005-05-03,2005/05/03,05/03/2005,03/05/2005,3,Tuesday,3,123,Weekday,...,N,2,2005,2005-05,2005Q2,11,4,2005,2005-11,2005Q4
3,20050504,2005-05-04,2005/05/04,05/04/2005,04/05/2005,4,Wednesday,4,124,Weekday,...,N,2,2005,2005-05,2005Q2,11,4,2005,2005-11,2005Q4
4,20050505,2005-05-05,2005/05/05,05/05/2005,05/05/2005,5,Thursday,5,125,Weekday,...,N,2,2005,2005-05,2005Q2,11,4,2005,2005-11,2005Q4

In [69]:
#show new fact rental table updated to have dimensions
sql_rental = "SELECT * FROM sakila_2.fact_rental;"
df_fact_rental = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_rental)
#final change to column order
df_fact_rental=df_fact_rental[['fact_rental_key','rental_key','customer_key', 'film_key','amount','rental_date_key','return_date_key','payment_date_key','last_update_key']]

dataframe = df_fact_rental
table_name = 'fact_rental'
primary_key = 'fact_rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)
df_fact_rental.head(2)

,fact_rental_key,rental_key,customer_key,film_key,amount,rental_date_key,return_date_key,payment_date_key,last_update_key
0,1,1,130,80,2.99,20050524,20050526,20050524,20060215
1,2,2,459,333,2.99,20050524,20050528,20050524,20060215

## Validation
The sakila_2 data mart now contains a date dimension table, a customer dimension table, a film dimension table, and a rental fact table. To demonstrate the data marts functionality, I first found and listed the customers that spent the most money on dvd rentals. I also found the total revenue of each film and displayed them in descending order.

In [74]:
#tests the customers dimension table and the rental fact table
sql_test= """
SELECT CONCAT(customers.first_name, ' '
, customers.last_name) as full_name
, SUM(rental.amount) AS customer_spending
FROM `{0}`.fact_rental AS rental
INNER JOIN `{0}`.dim_customers AS customers 
ON rental.customer_key = customers.customer_key
GROUP BY full_name
ORDER BY customer_spending DESC
LIMIT 10;
""".format(dst_dbname)

df_test = get_sql_dataframe(user_id,pwd, host_name, src_dbname, sql_test)
df_test.head(10)

        full_name  customer_spending
0       KARL SEAL             221.55
1    ELEANOR HUNT             216.54
2      CLARA SHAW             195.58
3   MARION SNYDER             194.61
4  RHONDA KENNEDY             194.61
5   TOMMY COLLAZO             186.62
6     WESLEY BULL             177.60
7        TIM CARY             175.61
8     MARCIA DEAN             175.58
9     ANA BRADLEY             174.66

In [82]:
#tests the film dimension table and the rental fact table
#using the date dimension as well to find the the quantities for the month of june
sql_test= """
SELECT f.title as film_title
, COUNT(rental.rental_key) as num_rentals
, SUM(rental.amount) AS film_revenue
FROM `{0}`.fact_rental AS rental
INNER JOIN `{0}`.dim_film AS f 
ON rental.film_key = f.film_key
INNER JOIN `{0}`.dim_date AS dd
ON rental.rental_date_key = dd.date_key
WHERE dd.month_of_year = 6
GROUP BY f.title
ORDER BY film_revenue DESC
LIMIT 10;
""".format(dst_dbname)

df_test = get_sql_dataframe(user_id,pwd, host_name, src_dbname, sql_test)
df_test.head(10)

              film_title  num_rentals  film_revenue
0       TELEGRAPH VOYAGE            5         47.95
1      VELVET TERMINATOR            6         41.94
2       PELICAN COMFORTS            5         40.95
3          KISSING DOLLS            5         39.95
4      GOODFELLAS SALUTE            5         36.95
5         MASSACRE USUAL            5         36.95
6             ENEMY ODDS            5         36.95
7      ATTRACTION NEWTON            5         33.95
8  FORRESTER COMANCHEROS            6         33.94
9     BUCKET BROTHERHOOD            6         33.94